###############################################
# Utilities
###############################################
cask "raycast"
cask "arc"
cask "warp"
cask "vlc"
cask "hiddenbar"
# cask "hazeover" # use mas version
cask "parsec"
cask "rectangle"
cask "obsidian"
cask "dropbox"
cask "nordvpn"
cask "tunnelblick"
# cask "android-file-transfer"
# cask "logi-options-plus"
cask "stats"
tap "localsend/localsend"
cask "localsend"
brew "mas"
brew "deno"


###############################################
# Development
###############################################

# Core apps
cask "docker"
cask "visual-studio-code"
cask "fork"
# cask "iterm2"
# brew "starship"
# cask "google-chrome"

# Utilities
cask "provisionql"
# cask "charles"
cask "proxyman"
# cask "http-toolkit"
# cask "minisim"
brew "xcodes"
cask "kdiff3"
# cask "vnc-viewer"
# cask "microsoft-remote-desktop"
# cask "azure-data-studio"
brew "tlrc"
brew "jq"
brew "zoxide"
brew "fzf"
brew "tailscale"

# React-Native
brew "rbenv"
tap "homebrew/cask-versions"
cask "zulu17"
brew "watchman"
cask "zulu11" # For RN v0.68
cask "android-studio"
cask "react-native-debugger"
brew "scrcpy"
cask "obs"

# Infrastructure
# cask "google-cloud-sdk"
tap "hashicorp/tap"
brew "hashicorp/tap/terraform"

# Python
# brew "pyenv"
# cask "pycharm-ce"

###############################################
# Personal
###############################################

cask "spotify"
# cask "keepassxc"
cask "lastpass"
brew "lastpass-cli"
# cask "whatsapp"
# cask "gimp"
cask "discord"
# brew "onedrive"
# cask "messenger"

# tap "homebrew/cask-fonts"
# cask "font-fira-code-nerd-font"


# ##############################################
# # VSCode plugins
# ###############################################

vscode "EditorConfig.EditorConfig"
vscode "streetsidesoftware.code-spell-checker"
vscode "naumovs.color-highlight"
vscode "artdiniz.quitcontrol-vscode"
vscode "nrwl.angular-console"
vscode "hashicorp.terraform"
vscode "redhat.vscode-yaml"
vscode "ctcuff.font-preview"
vscode "tomoki1207.pdf"
vscode "jock.svg"
vscode "rangav.vscode-thunder-client"
# vscode "GitHub.copilot" # no copilot for now
# vscode "GitHub.copilot-chat" # no copilot for now
vscode "leonn534.dark-minimalist-icons"
vscode "formulahendry.auto-complete-tag"
vscode "asciidoctor.asciidoctor-vscode"
vscode "phplasma.csv-to-table"
vscode "coenraads.disableligatures"
vscode "ms-azuretools.vscode-docker"
vscode "editorconfig.editorconfig"
vscode "dbaeumer.vscode-eslint"
vscode "github.vscode-github-actions"
vscode "eamodio.gitlens"
vscode "vscjava.vscode-gradle"
vscode "orta.vscode-jest"
vscode "firsttris.vscode-jest-runner"
vscode "vintharas.learn-vim"
vscode "mathiasfrohlich.kotlin"
vscode "yzhang.markdown-all-in-one"
vscode "bierner.markdown-mermaid"
vscode "takumii.markdowntable"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "zhuangtongfa.material-theme"
vscode "ionutvmi.path-autocomplete"
vscode "yoavbls.pretty-ts-errors"
vscode "thinker.sort-json"
vscode "svelte.svelte-vscode"
vscode "sswg.swift-lang"
vscode "bradlc.vscode-tailwindcss"
vscode "gruntfuggly.todo-tree"
vscode "orta.vscode-twoslash-queries"
# vscode "styled-components.vscode-styled-components"
vscode "redhat.vscode-xml"
vscode "unifiedjs.vscode-mdx"
vscode "esbenp.prettier-vscode"
vscode "vscodevim.vim"
vscode "denoland.vscode-deno"
vscode "JabedHossain.web-preview"
vscode "msjsdiag.vscode-react-native"
vscode "artdiniz.quitcontrol-vscode"
vscode "hashicorp.terraform"
vscode "tamasfe.even-better-toml"
vscode "expo.vscode-expo-tools"
vscode "drcika.apc-extension"